app/controllers/users/omniauth_callbacks_controller.rb

SELECT  "user_providers".* FROM "user_providers" WHERE "user_providers"."provider" = $1 AND "user_providers"."uid" = $2 ORDER BY "user_providers"."id" ASC LIMIT $3  [["provider", "twitter"], ["uid", "4189230853"], ["LIMIT", 1]]
---
    def twitter
      @client  = Twitter::REST::Client.new do |config|
      config.consumer_key        = "CSJLMOtBRbDMcX1tY1M02XmjO"
      config.consumer_secret     = "lY0YCBmh5NsMN4WB3miwKY8kYMtsmeJbcUg3RQG6oLd3ZG0EdD"
      end

        auth = request.env["omniauth.auth"]
        $tweets = @client.user_timeline(auth[:info][:nickname])

        @user = UserProvider.find_for_twitter_oauth(request.env["omniauth.auth"])